using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace KL
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }


        public delegate string CalculateTest(string test);
        private void Form1_Load(object sender, EventArgs e)
        {
            button1.Click += (s, a) => { label1.Text = $"{FindTest(textBox1.Text)}"; };
        }

        private string FindTest(string line)
        {
            foreach (var item in calcTest)
            {
                if (line.Contains(item.Key))
                {
                    return item.Value(line);
                }
            }
            return "***";
        }




      




        Dictionary<string, CalculateTest> calcTest = new Dictionary<string, CalculateTest>()
        {
            { "Визначити і підкреслити, якою буде друга цифра після коми результату переведення без заокруглення записаного у системі числення з основою ", Test1.Test},
            { "Якою буде ціла частина X результату переведення записаного у системі числення з основою",                                            Test2.Test},
            { "Яким буде результат X обчислення виразу X=abs(M)+NmodM, якщо ",                                                                      Test3.Test},
            { "Скільки разів квантовий комп'ютер, що складається з",                                                                                Test4.Test},
            { "Яким, за теоремою Котельнікова, в пс, може бути найбільший період T вимірювання синусоідального сигналу ",                           Test5.Test},
            { "Яка найменша кількість двійкових розрядів потрібна для кодування ",                                                                  Test6.Test},
            { "Скільки інформації I містить запис 10-кового числа ",                                                                                Test7.Test},
            { "чому дорівнює кодова відстань між шістнадцятьковими числами" ,                                                                       Test8.Test},
            { "повинен містити код Хеммінга" ,                                                                                                      Test8.Test},
            { "яким буде контрольний розряд при здійсненні контроля на " ,                                                                          Test8.Test},
            { "При пересиланні повідомлення використовується код Хеммінга, " ,                                                                      Test9.Test},
            { "у простому полі Галуа GF" ,                                                                                                          Test10.Test},
            { "молодших біти двійкового еквіваленту десяткового числа" ,                                                                            Test11_12.Test_12},
            { "Визначити найменшу кількість входів у елементів базису \"АБО, НЕ\","  ,                                                              Test13.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"АБО, НЕ\","  ,                                                             Test13.Test},
            { "Визначити найменшу кількість входів у елементів базису Буля," ,                                                                      Test13.Test},
            { "Визначити найменшу кількість виходів у елементів базису Буля," ,                                                                     Test13.Test},
            { "Визначити найменшу кількість входів у елементів базису \"І, НЕ\","  ,                                                                Test13.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"І, НЕ\","  ,                                                               Test13.Test},
            { "Визначити найменшу кількість входів у елементів базису \"АБО-НЕ\"" ,                                                                 Test14.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"АБО-НЕ\"",                                                                 Test14.Test},
            { "Скільки КМОН-транзисторів необхідно для створення схеми " ,                                                                          Test14.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"І-НЕ\"" ,                                                                  Test14.Test},
            { "Визначити найменшу кількість входів у елементів базису \"І-НЕ\"" ,                                                                   Test14.Test},
            { "Скільки літер додає до скороченої ДНФ функції " ,                                                                                    Test15.Test},
            { "За правилами N-значної алгебри логіки Поста " ,                                                                                      Test15.Test},
            { "Скільки виходів дешифратора з входами для всіх змінних необхідно з'єднати з елементом АБО " ,                                        Test16.Test},
            { "Яку найменшу кількість входів повинен мати елемент АБО у схемі на основі дешифратора" ,                                              Test16.Test},
            { "На скільки інформаційних входів мультиплексора з входами керування" ,                                                                Test17.Test},
            { "Визначити і підкреслити, скільки (у 16-ковій системі числення) виходів має ПЗП з організацією" ,                                     Test18.Test},
            { "Визначити і підкреслити, на скільки (у 16-ковій системі числення) більше входів має ПЗП" ,                                           Test18.Test},
            { "де M і N - дворозрядні двійкові числа, розряди яких m0, m1, n0, n1 заведені на адресні входи a0,…,a3 ПЗП і 0-ві розряди - молодші" , Test19.Test},
            { "Скільки рівних 0 двійкових переносів сформ" ,                                                                                        Test20.Test},
            { "Скільки рівних 1 двійкових переносів сформ" ,                                                                                        Test20.Test},
            { "Скільки рівних 1 ознак" ,                                                                                                            Test20.Test},
            { "Визначити і підкреслити мінімальну розрядність зворотного зв'язку (кількість біт у 16-ковій системі числення) в автоматі" ,          Test21.Test},
            { "На R та S входи " ,                                                                                                                  Test22.Test},
            { "На D та CE входи D-тригера" ,                                                                                                        Test23.Test},
            { "На D вхід 16-бітного регістра зсуву з послідовним входом і паралельним виходом" ,                                                    Test24.Test},
            { "Генератор псевдовипадкових кодів" ,                                                                                                  Test25.Test},
            { "Яку найменшу кількість K разом виводів адреси та даних повинно мати ОЗП з організацією" ,                                            Test26.Test},
            { "Визначити, скільки найменше виходів K має комбінаційна схема автомата" ,                                                             Test28.Test},
            { "Помножувач здійснює операцію над 16-ковими цілими і додатніми" ,                                                                     Test30.Test},
            { "Формат чисел з рухомою комою складється " ,                                                                                          Test30.Test},


        };
    }
}
