using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace KL
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }


        public delegate string CalculateTest(string test);
        private void Form1_Load(object sender, EventArgs e)
        {
            button1.Click += (s, a) => { label1.Text = $"{FindTest(textBox1.Text)}"; };
        }

        private string FindTest(string line)
        {
            foreach (var item in calcTest)
            {
                if (line.Contains(item.Key))
                {
                    return item.Value(line);
                }
            }
            return "***";
        }




        MultiValueDictionary<string, CalculateTest> calcTest2 = new Dictionary<string, CalculateTest>(){}

        /* private string FindTest(string line)
         {
             string result = string.Empty;
             if (line.Contains("Визначити і підкреслити, якою буде друга цифра після коми результату переведення без заокруглення записаного у системі числення з основою "))
                 result = Test1.Test_1(line);
             else if (line.Contains("Якою буде ціла частина X результату переведення записаного у системі числення з основою"))
                 result = Test2.Test_2(line);
             else if (line.Contains("Яким буде результат X обчислення виразу X=abs(M)+NmodM, якщо "))
                 result = Test3.Test_3(line);
             else if (line.Contains("Скільки разів квантовий комп'ютер, що складається з"))
                 result = Test4.Test_4(line);
             else if (line.Contains("Яким, за теоремою Котельнікова, в пс, може бути найбільший період T вимірювання синусоідального сигналу "))
                 result = Test5.Test_5(line);
             else if (line.Contains("Яка найменша кількість двійкових розрядів потрібна для кодування "))
                 result = Test6.Test_6(line);
             else if (line.Contains("Скільки інформації I містить запис 10-кового числа "))
                 result = Test7.Test_7(line);
             else if (line.Contains("чому дорівнює кодова відстань між шістнадцятьковими числами")
                 || line.Contains("повинен містити код Хеммінга")
                 || line.Contains("яким буде контрольний розряд при здійсненні контроля на "))
                 result = Test8.Test_8(line);
             else if (line.Contains("При пересиланні повідомлення використовується код Хеммінга, "))
                 result = Test9.Test_9(line);
             else if (line.Contains("у простому полі Галуа GF"))
                 result = Test10.Test_10(line);
             else if (line.Contains("Визначити і підкреслити, яким буде результат")              
                 && line.Contains(" молодших біти двійкового еквіваленту десяткового числа "))
                 result = Test12.Test_12(line);
             else if (line.Contains("Визначити найменшу кількість входів у елементів базису \"АБО, НЕ\",")
                   || line.Contains("Визначити найменшу кількість виходів у елементів базису \"АБО, НЕ\",")
                   || line.Contains("Визначити найменшу кількість входів у елементів базису Буля,")//
                   || line.Contains("Визначити найменшу кількість виходів у елементів базису Буля,")
                   || line.Contains("Визначити найменшу кількість входів у елементів базису \"І, НЕ\",")
                   || line.Contains("Визначити найменшу кількість виходів у елементів базису \"І, НЕ\","))
                 result = Test13.Test_13(line);
             else if (line.Contains("Визначити найменшу кількість входів у елементів базису \"АБО-НЕ\"")
                   || line.Contains("Визначити найменшу кількість виходів у елементів базису \"АБО-НЕ\"")
                   || line.Contains("Скільки КМОН-транзисторів необхідно для створення схеми ")
                   || line.Contains("Визначити найменшу кількість виходів у елементів базису \"І-НЕ\"")
                   || line.Contains("Визначити найменшу кількість входів у елементів базису \"І-НЕ\""))
                 result = Test14.Test_14(line);
             else if (line.Contains("Скільки літер додає до скороченої ДНФ функції ")
                 || line.Contains("За правилами N-значної алгебри логіки Поста "))
                 result = Test15.Test_15(line);
             else if (line.Contains("Скільки виходів дешифратора з входами для всіх змінних необхідно з'єднати з елементом АБО ")
                  || line.Contains("Яку найменшу кількість входів повинен мати елемент АБО у схемі на основі дешифратора"))
                 result = Test16.Test_16(line);
             else if (line.Contains("На скільки інформаційних входів мультиплексора з входами керування"))
                 result = Test17.Test_17(line);
             else if (line.Contains("Визначити і підкреслити, скільки (у 16-ковій системі числення) виходів має ПЗП з організацією")
                 || line.Contains("Визначити і підкреслити, на скільки (у 16-ковій системі числення) більше входів має ПЗП"))
                 result = Test18.Test_18(line);
             else if (line.Contains("Визначити і підкреслити, яким буде 16-ковий результат") && line.Contains("зсуву")
                 || line.Contains("де M і N - дворозрядні двійкові числа, розряди яких m0, m1, n0, n1 заведені на адресні входи a0,…,a3 ПЗП і 0-ві розряди - молодші"))
                 result = Test19.Test_19(line);
             else if (line.Contains("Скільки рівних 0 двійкових переносів сформ")
                  || line.Contains("Скільки рівних 1 двійкових переносів сформ")
                  || line.Contains("Скільки рівних 1 ознак"))
                 result = Test20.Test_20(line);
             else if (line.Contains("Визначити і підкреслити мінімальну розрядність зворотного зв'язку (кількість біт у 16-ковій системі числення) в автоматі"))
                 result = Test21.Test_21(line);
             else if (line.Contains("На R та S входи "))
                 result = Test22.Test_22(line);
             else if (line.Contains("На D та CE входи D-тригера"))
                 result = Test23.Test_23(line);
             else if (line.Contains("На D вхід 16-бітного регістра зсуву з послідовним входом і паралельним виходом"))
                 result = Test24.Test_24(line);
             else if (line.Contains("Генератор псевдовипадкових кодів"))
                 result = Test25.Test_25(line);
             else if (line.Contains("Яку найменшу кількість K разом виводів адреси та даних повинно мати ОЗП з організацією"))
                 result = Test26.Test_26(line);
             else if (line.Contains("Визначити, скільки найменше виходів K має комбінаційна схема автомата"))
                 result = Test28.Test_28(line);
             else if (line.Contains("Визначити, визначити в бітах об'єм V ПЗП мікропрограмного автомата "))
                 result = Test29.Test_29(line);

             return Convert.ToString(Convert.ToInt32(result),16).ToUpper();




         }
 */



        Dictionary<string, CalculateTest> calcTest = new Dictionary<string, CalculateTest>()
        {
            { "Визначити і підкреслити, якою буде друга цифра після коми результату переведення без заокруглення записаного у системі числення з основою ", Test1.Test},
            { "Якою буде ціла частина X результату переведення записаного у системі числення з основою",                                            Test2.Test},
            { "Яким буде результат X обчислення виразу X=abs(M)+NmodM, якщо ",                                                                      Test3.Test},
            { "Скільки разів квантовий комп'ютер, що складається з",                                                                                Test4.Test},
            { "Яким, за теоремою Котельнікова, в пс, може бути найбільший період T вимірювання синусоідального сигналу ",                           Test5.Test},
            { "Яка найменша кількість двійкових розрядів потрібна для кодування ",                                                                  Test6.Test},
            { "Скільки інформації I містить запис 10-кового числа ",                                                                                Test7.Test},
            { "чому дорівнює кодова відстань між шістнадцятьковими числами" ,                                                                       Test8.Test},
            { "повинен містити код Хеммінга" ,                                                                                                      Test8.Test},
            { "яким буде контрольний розряд при здійсненні контроля на " ,                                                                          Test8.Test},
            { "При пересиланні повідомлення використовується код Хеммінга, " ,                                                                      Test9.Test},
            { "у простому полі Галуа GF" ,                                                                                                          Test10.Test},
            { "молодших біти двійкового еквіваленту десяткового числа" ,                                                                            Test11_12.Test_12},
            { "Визначити найменшу кількість входів у елементів базису \"АБО, НЕ\","  ,                                                              Test13.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"АБО, НЕ\","  ,                                                             Test13.Test},
            { "Визначити найменшу кількість входів у елементів базису Буля," ,                                                                      Test13.Test},
            { "Визначити найменшу кількість виходів у елементів базису Буля," ,                                                                     Test13.Test},
            { "Визначити найменшу кількість входів у елементів базису \"І, НЕ\","  ,                                                                Test13.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"І, НЕ\","  ,                                                               Test13.Test},
            { "Визначити найменшу кількість входів у елементів базису \"АБО-НЕ\"" ,                                                                 Test14.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"АБО-НЕ\"",                                                                 Test14.Test},
            { "Скільки КМОН-транзисторів необхідно для створення схеми " ,                                                                          Test14.Test},
            { "Визначити найменшу кількість виходів у елементів базису \"І-НЕ\"" ,                                                                  Test14.Test},
            { "Визначити найменшу кількість входів у елементів базису \"І-НЕ\"" ,                                                                   Test14.Test},
            { "Скільки літер додає до скороченої ДНФ функції " ,                                                                                    Test15.Test},
            { "За правилами N-значної алгебри логіки Поста " ,                                                                                      Test15.Test},
            { "Скільки виходів дешифратора з входами для всіх змінних необхідно з'єднати з елементом АБО " ,                                        Test16.Test},
            { "Яку найменшу кількість входів повинен мати елемент АБО у схемі на основі дешифратора" ,                                              Test16.Test},
            { "На скільки інформаційних входів мультиплексора з входами керування" ,                                                                Test17.Test},
            { "Визначити і підкреслити, скільки (у 16-ковій системі числення) виходів має ПЗП з організацією" ,                                     Test18.Test},
            { "Визначити і підкреслити, на скільки (у 16-ковій системі числення) більше входів має ПЗП" ,                                           Test18.Test},
            { "де M і N - дворозрядні двійкові числа, розряди яких m0, m1, n0, n1 заведені на адресні входи a0,…,a3 ПЗП і 0-ві розряди - молодші" , Test19.Test},
            { "Скільки рівних 0 двійкових переносів сформ" ,                                                                                        Test20.Test},
            { "Скільки рівних 1 двійкових переносів сформ" ,                                                                                        Test20.Test},
            { "Скільки рівних 1 ознак" ,                                                                                                            Test20.Test},
            { "Визначити і підкреслити мінімальну розрядність зворотного зв'язку (кількість біт у 16-ковій системі числення) в автоматі" ,          Test21.Test},
            { "На R та S входи " ,                                                                                                                  Test22.Test},
            { "На D та CE входи D-тригера" ,                                                                                                        Test23.Test},
            { "На D вхід 16-бітного регістра зсуву з послідовним входом і паралельним виходом" ,                                                    Test24.Test},
            { "Генератор псевдовипадкових кодів" ,                                                                                                  Test25.Test},
            { "Яку найменшу кількість K разом виводів адреси та даних повинно мати ОЗП з організацією" ,                                            Test26.Test},
            { "Визначити, скільки найменше виходів K має комбінаційна схема автомата" ,                                                             Test28.Test},
            { "Помножувач здійснює операцію над 16-ковими цілими і додатніми" ,                                                                     Test30.Test},
            { "Формат чисел з рухомою комою складється " ,                                                                                          Test30.Test},


        };
    }
}
